//***********************************************
// 程序功能:  函数/寄存器 申明
// 入口参数:
// 出口参数:
// 影响资源:
// 占用堆栈:
//***********************************************
// 前缀部分定义说明	:	
// 常量定义前缀		: C_
// I/O口定义前缀	: p_		 	
// 寄存器定义前缀	: d_		  	
// 标志位定义前缀 	: f_		  	
//***********************************************
#ifndef __Steppermotor_h__
#define __Steppermotor_h__
//***********************************************
//包含的头文件

//***********************************************
// 变量申明

//===============================================
// 数组定义  	 
//***********************************************
void Motor(int Motor_speed,int Motor_angle,char Motor_dir);//Motor(项切换延时；转动角度；0正转1反转)
void motor_io_Init(void) ; //引脚定义
#endif




